//SMYERSJ  JOB 1,'STEVE MYERS',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//PREP    EXEC PGM=IEFBR14
//GBLXREF  DD  DISP=(MOD,DELETE),UNIT=SYSDA,SPACE=(TRK,0),
//             DSN=&SYSUID..GBLXREF.SYSPRINT
//A       EXEC PGM=GBLXREF
//STEPLIB  DD  DISP=(SHR,PASS),DSN=&SYSUID..GBLXREF.LOAD
//SYSPRINT DD  DISP=(,CATLG),UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),
//             DSN=*.PREP.GBLXREF
//SYSADATA DD  DISP=SHR,DSN=&SYSUID..JES2.V2L5.ADATA
